# Explorando Base de dados da Seguradora

## Importando Bibliotecas ou Packages

In [1]:
import pandas as pd
import os

### Atalhos

•   Comando jupyter notebook inicializa o servidor.

•   A cria uma célula acima.

•   B cria uma célula abaixo.

•	D apaga uma célula.

•	M muda uma célula para markdown.

•	Y muda uma célula para code.

•	D,D apaga uma célula.

•	C cópia uma célula.

## Importando os dados csv

### Definindo current_path

In [2]:
current_path = os.getcwd()
#print(current_path)
#dados/aluguel.csv
dados_seguradora = pd.read_csv(os.path.join(current_path,'dados','aluguel.csv'),sep=';')
dados_seguradora

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU,Valor m2,Tipo Agregado
0,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0,53.33,Apartamento
1,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,0.0,16.67,Apartamento
2,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0,26.00,Apartamento
3,Apartamento,Grajaú,2,1,0,70,1500.0,642.0,74.0,21.43,Apartamento
4,Apartamento,Lins de Vasconcelos,3,1,1,90,1500.0,455.0,14.0,16.67,Apartamento
...,...,...,...,...,...,...,...,...,...,...,...
19826,Quitinete,Glória,1,0,0,10,400.0,107.0,10.0,40.00,Apartamento
19827,Quitinete,Flamengo,1,0,0,23,900.0,605.0,0.0,39.13,Apartamento
19828,Quitinete,Centro,1,0,0,24,1100.0,323.0,0.0,45.83,Apartamento
19829,Quitinete,Copacabana,1,0,0,22,1500.0,286.0,200.0,68.18,Apartamento
19830,Quitinete,Centro,0,0,0,27,800.0,350.0,25.0,29.63,Apartamento

## Importando json

In [3]:
file_dados_path_json = os.getcwd() + '/dados' + '/aluguel.json'
json = open(file_dados_path_json,'r',encoding='utf-8')
print(json.read())

[{"Tipo":"Quitinete","Bairro":"Copacabana","Quartos":1,"Vagas":0,"Suites":0,"Area":40,"Valor":1700.0,"Condominio":500.0,"IPTU":60.0},
{"Tipo":"Casa","Bairro":"Jardim Bot\u00e2nico","Quartos":2,"Vagas":0,"Suites":1,"Area":100,"Valor":7000.0,"Condominio":null,"IPTU":null},
{"Tipo":"Conjunto Comercial\/Sala","Bairro":"Barra da Tijuca","Quartos":0,"Vagas":4,"Suites":0,"Area":150,"Valor":5200.0,"Condominio":4020.0,"IPTU":1111.0},
{"Tipo":"Apartamento","Bairro":"Centro","Quartos":1,"Vagas":0,"Suites":0,"Area":15,"Valor":800.0,"Condominio":390.0,"IPTU":20.0},
{"Tipo":"Apartamento","Bairro":"Higien\u00f3polis","Quartos":1,"Vagas":0,"Suites":0,"Area":48,"Valor":800.0,"Condominio":230.0,"IPTU":null},
{"Tipo":"Apartamento","Bairro":"Vista Alegre","Quartos":3,"Vagas":1,"Suites":0,"Area":70,"Valor":1200.0,"Condominio":null,"IPTU":null},
{"Tipo":"Apartamento","Bairro":"Cachambi","Quartos":2,"Vagas":0,"Suites":0,"Area":50,"Valor":1300.0,"Condominio":301.0,"IPTU":17.0},
{"Tipo":"Casa de Condom\u00ednio","Bairro":"Barra da Tijuca","Quartos":5,"Vagas":4,"Suites":5,"Area":750,"Valor":22000.0,"Condominio":null,"IPTU":null},
{"Tipo":"Casa de Condom\u00ednio","Bairro":"Ramos","Quartos":2,"Vagas":2,"Suites":0,"Area":65,"Valor":1000.0,"Condominio":null,"IPTU":null},
{"Tipo":"Conjunto Comercial\/Sala","Bairro":"Centro","Quartos":0,"Vagas":3,"Suites":0,"Area":695,"Valor":35000.0,"Condominio":19193.0,"IPTU":3030.0}]

In [4]:
df_json = pd.read_json(file_dados_path_json)
df_json

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000,NaN,NaN
2,Conjunto Comercial/Sala,Barra da Tijuca,0,4,0,150,5200,4020.0,1111.0
3,Apartamento,Centro,1,0,0,15,800,390.0,20.0
4,Apartamento,Higienópolis,1,0,0,48,800,230.0,NaN
5,Apartamento,Vista Alegre,3,1,0,70,1200,NaN,NaN
6,Apartamento,Cachambi,2,0,0,50,1300,301.0,17.0
7,Casa de Condomínio,Barra da Tijuca,5,4,5,750,22000,NaN,NaN
8,Casa de Condomínio,Ramos,2,2,0,65,1000,NaN,NaN
9,Conjunto Comercial/Sala,Centro,0,3,0,695,35000,19193.0,3030.0

## Importando txt

In [5]:
file_dados_path_txt = os.getcwd() + '/dados' + '/aluguel.txt'
txt = open(file_dados_path_txt,'r',encoding='utf-8')
print(txt.read())

Tipo	Bairro	Quartos	Vagas	Suites	Area	Valor	Condominio	IPTU
Quitinete	Copacabana	1	0	0	40	1700	500	60
Casa	Jardim Botânico	2	0	1	100	7000
Conjunto Comercial/Sala	Barra da Tijuca	0	4	0	150	5200	4020	1111
Apartamento	Centro	1	0	0	15	800	390	20
Apartamento	Higienópolis	1	0	0	48	800	230
Apartamento	Vista Alegre	3	1	0	70	1200
Apartamento	Cachambi	2	0	0	50	1300	301	17
Casa de Condomínio	Barra da Tijuca	5	4	5	750	22000
Casa de Condomínio	Ramos	2	2	0	65	1000
Conjunto Comercial/Sala	Centro	0	3	0	695	35000	19193	3030

In [6]:
df_txt = pd.read_table(file_dados_path_txt)
df_txt

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000,NaN,NaN
2,Conjunto Comercial/Sala,Barra da Tijuca,0,4,0,150,5200,4020.0,1111.0
3,Apartamento,Centro,1,0,0,15,800,390.0,20.0
4,Apartamento,Higienópolis,1,0,0,48,800,230.0,NaN
5,Apartamento,Vista Alegre,3,1,0,70,1200,NaN,NaN
6,Apartamento,Cachambi,2,0,0,50,1300,301.0,17.0
7,Casa de Condomínio,Barra da Tijuca,5,4,5,750,22000,NaN,NaN
8,Casa de Condomínio,Ramos,2,2,0,65,1000,NaN,NaN
9,Conjunto Comercial/Sala,Centro,0,3,0,695,35000,19193.0,3030.0

### Importando Excel

In [7]:
file_dados_path_xlsx = os.getcwd() + '/dados' + '/aluguel.xlsx'
df_xlsx = pd.read_excel(file_dados_path_xlsx)
df_xlsx

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000,NaN,NaN
2,Conjunto Comercial/Sala,Barra da Tijuca,0,4,0,150,5200,4020.0,1111.0
3,Apartamento,Centro,1,0,0,15,800,390.0,20.0
4,Apartamento,Higienópolis,1,0,0,48,800,230.0,NaN
5,Apartamento,Vista Alegre,3,1,0,70,1200,NaN,NaN
6,Apartamento,Cachambi,2,0,0,50,1300,301.0,17.0
7,Casa de Condomínio,Barra da Tijuca,5,4,5,750,22000,NaN,NaN
8,Casa de Condomínio,Ramos,2,2,0,65,1000,NaN,NaN
9,Conjunto Comercial/Sala,Centro,0,3,0,695,35000,19193.0,3030.0

### Importando HTML

In [8]:
file_dados_path_html = os.getcwd() + '/dados' + '/dados_html_1.html'
df_html = pd.read_html(file_dados_path_html)
df_html[0]

  FAIXA ETÁRIA UNAFISCO SAÚDE SOFT II SOFT PARTICIPATIVO      UNIQUE
0      00 A 18               R$218,99           R$192,60    R$334,48
1      19 A 23               R$263,63           R$207,67    R$380,06
2      24 A 28               R$322,44           R$224,26    R$464,39
3      29 A 33               R$402,05           R$258,63    R$566,68
4      34 A 38               R$455,17           R$306,37    R$664,61
5      39 A 43               R$489,29           R$417,93    R$742,72
6      44 A 48               R$582,65           R$495,24    R$869,47
7      49 A 53               R$718,86           R$562,64  R$1.046,29
8      54 A 58               R$908,54           R$721,00  R$1.355,74
9   59 OU MAIS             R$1.244,50         R$1.151,62  R$2.003,53

In [9]:
file_dados_path_html_link = 'https://unafiscosaude.org.br/site/comparativo-de-planos/'
df_html_link = pd.read_html(file_dados_path_html_link)
df_html_link[0]

,NOME COMERCIAL PLANO >>,SOFT II,SOFT PARTICIPATIVO,UNIQUE,PREMIUM II,Unafisco Saúde Platinum
0,Registro ANS,Nº. 471839149,Nº. 478132175,Nº. 478131177,Nº. 468235121,Nº. 487705205
1,Situação do Plano ANS,Ativo,Ativo,Ativo,Ativo,Ativo
2,Tipo de Contratação,Coletivo por adesão,Coletivo por adesão,Coletivo por adesão,Coletivo por adesão,Coletivo por adesão
3,Segmentação Assistencial,"""Ambulatorial + Hospitalar com Obstetrícia","""Ambulatorial + Hospitalar com Obstetrícia","""Ambulatorial + Hospitalar com Obstetrícia + O...","""Ambulatorial + Hospitalar com Obstetrícia + O...","""Ambulatorial + Hospitalar com Obstetrícia + O..."
4,Odontologia,Não há,Não há,Sim (Rol ANS),Sim (Rol ANS) + extra ROL,Sim (Rol ANS) + Ortodontia
5,Formação do preço:,Preestabelecido,Preestabelecido,Preestabelecido,Preestabelecido,Preestabelecido
6,Vínculo do Beneficiário:,Sem Vínculo Empregatício,Sem Vínculo Empregatício,Sem Vínculo Empregatício,Sem Vínculo Empregatício,Sem Vínculo Empregatício
7,Padrão de acomodação,Apartamento (Acomodação Individual),Apartamento (Acomodação Individual),Apartamento (Acomodação Individual),Apartamento (Acomodação Individual),Apartamento (Acomodação Individual)
8,Coparticipação,Não há,"30% em consultas, exames, terapias e atendimen...","30% em consultas, exames, terapias e atendimen...",Não há,Não há
9,Cobertura de procedimentos,Limitada ao Rol ANS,Limitada ao Rol ANS,Limitada ao Rol ANS,Rol + cerca de 380 procedimentos extra cobertu...,Limitada ao Rol ANS
10,Serviços e coberturas adicionais:,Não há,Não há,Não há,- Assistência/internação domiciliar (Home Care...,- Acesso a rede odontológica de forma direta -...
11,Livre Escolha:,Não há,Não há,Reembolso conforme valores – Referencial de Ho...,Reembolso conforme valores – Referencial de Ho...,Reembolso conforme valores – Referencial de Ho...
12,Rede de atendimento:,básica conforme opções disponibilizadas por in...,básica conforme opções disponibilizadas por in...,básica + rede adicional conforme opções dispon...,básica + rede adicional (direta e indireta) + ...,básica + rede adicional (indireta e direta exc...

In [10]:
df_html_link[1]

,FAIXA ETÁRIA,SOFT II,UNIQUE,SOFT PARTICIPATIVO,PREMIUM II,PLATINUM
0,00 a 18,"R$ 251,41","R$ 361,42","R$ 208,11","R$ 549,96","R$ 435,62"
1,19 a 23,"R$ 302,68","R$ 410,67","R$ 224,39","R$ 624,93","R$ 494,98"
2,24 a 28,"R$ 370,20","R$ 501,79","R$ 242,32","R$ 763,58","R$ 604,81"
3,29 a 33,"R$ 461,60","R$ 612,32","R$ 279,46","R$ 931,75","R$ 738,03"
4,34 a 38,"R$ 522,59","R$ 718,14","R$ 331,05","R$ 1.024,93","R$ 865,57"
5,39 a 43,"R$ 561,75","R$ 802,54","R$ 451,59","R$ 1.145,38","R$ 967,29"
6,44 a 48,"R$ 668,94","R$ 939,50","R$ 535,13","R$ 1.340,82","R$ 1.132,37"
7,49 a 53,"R$ 825,34","R$ 1.130,56","R$ 607,96","R$ 1.613,50","R$ 1.362,65"
8,54 a 58,"R$ 1.043,10","R$ 1.464,94","R$ 779,07","R$ 2.090,74","R$ 1.765,67"
9,59 ou mais,"R$ 1.428,83","R$ 2.164,90","R$ 1.244,38","R$ 3.261,12","R$ 2.609,33"

In [11]:
file_dados_path_html_link_fr = 'https://www.federalreserve.gov/releases/h3/current/default.htm'
df_html_fr = pd.read_html(file_dados_path_html_link_fr)
len(df_html_fr)

3

In [12]:
df_html_fr[0]

                  Date      Reserve balances required  \
                  Date Reserve balance requirements 1
0              Month 7                        Month 7
1            Aug. 2019                         134639
2           Sept. 2019                         134707
3            Oct. 2019                         134998
4            Nov. 2019                         140705
5            Dec. 2019                         138984
6            Jan. 2020                         144816
7            Feb. 2020                         138370
8            Mar. 2020                         113139
9            Apr. 2020                              0
10            May 2020                              0
11           June 2020                              0
12           July 2020                              0
13           Aug. 2020                              0
14                 NaN                            NaN
15  Two weeks ending 8             Two weeks ending 8
16       July 15, 2020                              0
17       July 29, 2020                              0
18       Aug. 12, 2020                              0
19       Aug. 26, 2020                              0
20       Sept. 9, 2020                              0

                                                               \
   Top of penalty- free band 2 Bottom of penalty- free band 3
0                      Month 7                        Month 7
1                       148114                         121167
2                       148188                         121227
3                       148509                         121489
4                       154787                         126625
5                       152893                         125076
6                       159309                         130326
7                       152218                         124524
8                       124461                         101817
9                            0                              0
10                           0                              0
11                           0                              0
12                           0                              0
13                           0                              0
14                         NaN                            NaN
15          Two weeks ending 8             Two weeks ending 8
16                           0                              0
17                           0                              0
18                           0                              0
19                           0                              0
20                           0                              0

   Reserve balances maintained 4  \
                           Total
0                        Month 7
1                        1520876
2                        1439771
3                        1481513
4                        1529341
5                        1630090
6                        1645384
7                        1656989
8                        2045148
9                        2953586
10                       3217635
11                       3043556
12                       2718529
13                       2799719
14                           NaN
15            Two weeks ending 8
16                       2795785
17                       2623526
18                       2751124
19                       2821740
20                       2854690

                                                                  \
   Balances maintained to satisfy reserve balance requirements 5
0                                             Month 7
1                                              147555
2                                              147498
3                                              148050
4                                              154256
5                                              152562
6                                              158765
7                                              151612
8                                              124147
9                                                   0
10                                                  0
11                                                  0
12                                                  0
13                                                  0
14                                                NaN
15                                 Two weeks ending 8
16                                                  0
17                                                  0
18                                                  0
19                                                  0
20                                                  0


   Balances maintained that exceed the top of the penalty- free band 6
0                                             Month 7
1                                             1373321
2                                             1292273
3                                             1333462
4                                             1375085
5                                             1477528
6                                             1486619
7                                             1505377
8                                             1921000
9                                             2953586
10                                            3217635
11                                            3043556
12                                            2718529
13                                            2799719
14                                                NaN
15                                 Two weeks ending 8
16                                            2795785
17                                            2623526
18                                            2751124
19                                            2821740
20                                            2854690

In [13]:
df_html_fr[1]

                  Date            Reserves                      \
                  Date             Total 1            Required
0              Month 7             Month 7             Month 7
1            Aug. 2019             1586844              200608
2           Sept. 2019             1504805              199741
3            Oct. 2019             1547136              200621
4            Nov. 2019             1595222              206586
5            Dec. 2019             1698344              207239
6            Jan. 2020             1715219              214652
7            Feb. 2020             1726943              208324
8            Mar. 2020             2099369              167360
9            Apr. 2020             2953586                   0
10            May 2020             3217635                   0
11           June 2020             3043556                   0
12           July 2020             2718529                   0
13           Aug. 2020             2799719                   0
14                 NaN                 NaN                 NaN
15  Two weeks ending 8  Two weeks ending 8  Two weeks ending 8
16       July 15, 2020             2795785                   0
17       July 29, 2020             2623526                   0
18       Aug. 12, 2020             2751124                   0
19       Aug. 26, 2020             2821740                   0
20       Sept. 9, 2020             2854690                   0

          Vault cash 2                                      \
                 Total Used to satisfy required reserves 3
0              Month 7                             Month 7
1                78451                               65969
2                76550                               65035
3                76660                               65623
4                76921                               65881
5                80168                               68255
6                81216                               69835
7                80735                               69954
8                77114                               54222
9                88104                                   0
10              101345                                   0
11              104201                                   0
12               98392                                   0
13               95327                                   0
14                 NaN                                 NaN
15  Two weeks ending 8                  Two weeks ending 8
16               99459                                   0
17               97225                                   0
18               95638                                   0
19               95066                                   0
20               95313                                   0

                             Monetary base                              \
             Surplus 4             Total 5 Total balances maintained 6
0              Month 7             Month 7                     Month 7
1                12483             3271378                     1520876
2                11516             3202668                     1439771
3                11037             3252807                     1481513
4                11040             3315551                     1529341
5                11914             3426464                     1630090
6                11381             3442569                     1645384
7                10781             3454474                     1656989
8                22892             3883155                     2045148
9                88104             4844940                     2953586
10              101345             5149527                     3217635
11              104201             5001978                     3043556
12               98392             4700365                     2718529
13               95327             4807394                     2799719
14                 NaN                 NaN                         NaN
15  Two weeks ending 8  Two weeks ending 8          Two weeks ending 8
16               99459             4772522                     2795785
17               97225             4609143                     2623526
18               95638             4750981                     2751124
19               95066             4830999                     2821740
20               95313             4876690                     2854690


   Currency in circulation
0                  Month 7
1                  1750502
2                  1762898
3                  1771294
4                  1786209
5                  1796375
6                  1797185
7                  1797485
8                  1838007
9                  1891355
10                 1931891
11                 1958422
12                 1981836
13                 2007675
14                     NaN
15      Two weeks ending 8
16                 1976737
17                 1985617
18                 1999857
19                 2009260
20                 2022000

In [14]:
df_html_fr[2]

                  Date Borrowings from the Federal Reserve  \
                  Date                               Total
0              Month 3                             Month 3
1            Aug. 2019                                 117
2           Sept. 2019                                 101
3            Oct. 2019                                  63
4            Nov. 2019                                  26
5            Dec. 2019                                  21
6            Jan. 2020                                   6
7            Feb. 2020                                   3
8            Mar. 2020                               40554
9            Apr. 2020                              124461
10            May 2020                              111845
11           June 2020                               97671
12           July 2020                               92943
13           Aug. 2020                               83126
14                 NaN                                 NaN
15  Two weeks ending 4                  Two weeks ending 4
16       July 15, 2020                               94326
17       July 29, 2020                               92428
18       Aug. 12, 2020                               85636
19       Aug. 26, 2020                               82030
20       Sept. 9, 2020                               80170

                                                                \
               Primary           Secondary            Seasonal
0              Month 3             Month 3             Month 3
1                   16                   0                 101
2                   15                   0                  86
3                    4                   0                  59
4                    4                   0                  22
5                   10                   0                  11
6                    5                   0                   1
7                    3                   0                   0
8                19538                   0                   0
9                38299                   0                   0
10               22180                   0                   2
11                8456                   0                  11
12                4670                   0                  26
13                2851                   0                  38
14                 NaN                 NaN                 NaN
15  Two weeks ending 4  Two weeks ending 4  Two weeks ending 4
16                5055                   0                  21
17                4376                   0                  31
18                3111                   0                  37
19                2651                   0                  41
20                2786                   0                  34

                             Nonborrowed reserves 2
   Other credit extensions 1 Nonborrowed reserves 2
0                    Month 3                Month 3
1                          0                1586727
2                          0                1504704
3                          0                1547073
4                          0                1595196
5                          0                1698323
6                          0                1715213
7                          0                1726939
8                      21015                2058816
9                      86162                2829125
10                     89663                3105791
11                     89204                2945885
12                     88248                2625585
13                     80237                2716593
14                       NaN                    NaN
15        Two weeks ending 4     Two weeks ending 4
16                     89251                2701459
17                     88021                2531099
18                     82488                2665489
19                     79339                2739710
20                     77350                2774520

In [15]:
df_html_fr[2].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21 entries, 0 to 20
Data columns (total 7 columns):
 #   Column                                                            Non-Null Count  Dtype
---  ------                                                            --------------  -----
 0   (Date, Date)                                                      20 non-null     object
 1   (Borrowings from the Federal Reserve, Total)                      20 non-null     object
 2   (Borrowings from the Federal Reserve, Primary)                    20 non-null     object
 3   (Borrowings from the Federal Reserve, Secondary)                  20 non-null     object
 4   (Borrowings from the Federal Reserve, Seasonal)                   20 non-null     object
 5   (Borrowings from the Federal Reserve, Other credit extensions 1)  20 non-null     object
 6   (Nonborrowed reserves 2, Nonborrowed reserves 2)                  20 non-null     object
dtypes: object(7)
memory usage: 1.3+ KB

# Relatório de Análise I

In [16]:
dados_seguradora.head()

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU,Valor m2,Tipo Agregado
0,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0,53.33,Apartamento
1,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,0.0,16.67,Apartamento
2,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0,26.00,Apartamento
3,Apartamento,Grajaú,2,1,0,70,1500.0,642.0,74.0,21.43,Apartamento
4,Apartamento,Lins de Vasconcelos,3,1,1,90,1500.0,455.0,14.0,16.67,Apartamento

## Informações Gerais sobre  a Base de Dados

In [17]:
dados_seguradora.dtypes

Tipo              object
Bairro            object
Quartos            int64
Vagas              int64
Suites             int64
Area               int64
Valor            float64
Condominio       float64
IPTU             float64
Valor m2         float64
Tipo Agregado     object
dtype: object

## Tranformando em DataFrame

In [18]:
pd.DataFrame(dados_seguradora.dtypes)

                     0
Tipo            object
Bairro          object
Quartos          int64
Vagas            int64
Suites           int64
Area             int64
Valor          float64
Condominio     float64
IPTU           float64
Valor m2       float64
Tipo Agregado   object

In [19]:
tipos_de_dados = pd.DataFrame(dados_seguradora.dtypes, columns=['Tipos de Dados'])
tipos_de_dados

              Tipos de Dados
Tipo                  object
Bairro                object
Quartos                int64
Vagas                  int64
Suites                 int64
Area                   int64
Valor                float64
Condominio           float64
IPTU                 float64
Valor m2             float64
Tipo Agregado         object

In [20]:
tipos_de_dados.columns.name = 'Variáveis'
tipos_de_dados

Variáveis     Tipos de Dados
Tipo                  object
Bairro                object
Quartos                int64
Vagas                  int64
Suites                 int64
Area                   int64
Valor                float64
Condominio           float64
IPTU                 float64
Valor m2             float64
Tipo Agregado         object

In [21]:
dados_seguradora.shape

(19831, 11)

In [22]:
imoveis = dados_seguradora.shape[0]
variaveis = dados_seguradora.shape[1]

In [23]:
print("imóveis: {}\nvariáveis: {}".format(imoveis,variaveis))

imóveis: 19831
variáveis: 11

In [24]:
print('A base de dados apresenta {} registros de imóveis, e {} variáveis'.format(imoveis,variaveis))

A base de dados apresenta 19831 registros de imóveis, e 11 variáveis